MikroElektronika/core_packages/PIC/XC8/def/PIC16C923/mcu.h
extern volatile LCDD06bits_t LCDD06bits __at(0x116);
// bitfield macros
#define _LCDD06_SEG16_POSN                                  0x0
#define _LCDD06_SEG16_POSITION                              0x0
#define _LCDD06_SEG16_SIZE                                  0x1
#define _LCDD06_SEG16_LENGTH                                0x1
#define _LCDD06_SEG16_MASK                                  0x1
#define _LCDD06_SEG17_POSN                                  0x1
#define _LCDD06_SEG17_POSITION                              0x1
#define _LCDD06_SEG17_SIZE                                  0x1
#define _LCDD06_SEG17_LENGTH                                0x1
#define _LCDD06_SEG17_MASK                                  0x2
#define _LCDD06_SEG18_POSN                                  0x2
#define _LCDD06_SEG18_POSITION                              0x2
#define _LCDD06_SEG18_SIZE                                  0x1
#define _LCDD06_SEG18_LENGTH                                0x1
#define _LCDD06_SEG18_MASK                                  0x4
#define _LCDD06_SEG19_POSN                                  0x3
#define _LCDD06_SEG19_POSITION                              0x3
#define _LCDD06_SEG19_SIZE                                  0x1
#define _LCDD06_SEG19_LENGTH                                0x1
#define _LCDD06_SEG19_MASK                                  0x8
#define _LCDD06_SEG20_POSN                                  0x4
#define _LCDD06_SEG20_POSITION                              0x4
#define _LCDD06_SEG20_SIZE                                  0x1
#define _LCDD06_SEG20_LENGTH                                0x1
#define _LCDD06_SEG20_MASK                                  0x10
#define _LCDD06_SEG21_POSN                                  0x5
#define _LCDD06_SEG21_POSITION                              0x5
#define _LCDD06_SEG21_SIZE                                  0x1
#define _LCDD06_SEG21_LENGTH                                0x1
#define _LCDD06_SEG21_MASK                                  0x20
#define _LCDD06_SEG22_POSN                                  0x6
#define _LCDD06_SEG22_POSITION                              0x6
#define _LCDD06_SEG22_SIZE                                  0x1
#define _LCDD06_SEG22_LENGTH                                0x1
#define _LCDD06_SEG22_MASK                                  0x40
#define _LCDD06_SEG23_POSN                                  0x7
#define _LCDD06_SEG23_POSITION                              0x7
#define _LCDD06_SEG23_SIZE                                  0x1
#define _LCDD06_SEG23_LENGTH                                0x1
#define _LCDD06_SEG23_MASK                                  0x80

// Register: LCDD07
#define LCDD07 LCDD07
extern volatile unsigned char           LCDD07              __at(0x117);
#ifndef _LIB_BUILD
asm("LCDD07 equ 0117h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG24                  :1;
        unsigned SEG25                  :1;
        unsigned SEG26                  :1;
        unsigned SEG27                  :1;
        unsigned SEG28                  :1;
        unsigned SEG29                  :1;
        unsigned SEG30                  :1;
        unsigned SEG31                  :1;
    };
} LCDD07bits_t;
extern volatile LCDD07bits_t LCDD07bits __at(0x117);
// bitfield macros
#define _LCDD07_SEG24_POSN                                  0x0
#define _LCDD07_SEG24_POSITION                              0x0
#define _LCDD07_SEG24_SIZE                                  0x1
#define _LCDD07_SEG24_LENGTH                                0x1
#define _LCDD07_SEG24_MASK                                  0x1
#define _LCDD07_SEG25_POSN                                  0x1
#define _LCDD07_SEG25_POSITION                              0x1
#define _LCDD07_SEG25_SIZE                                  0x1
#define _LCDD07_SEG25_LENGTH                                0x1
#define _LCDD07_SEG25_MASK                                  0x2
#define _LCDD07_SEG26_POSN                                  0x2
#define _LCDD07_SEG26_POSITION                              0x2
#define _LCDD07_SEG26_SIZE                                  0x1
#define _LCDD07_SEG26_LENGTH                                0x1
#define _LCDD07_SEG26_MASK                                  0x4
#define _LCDD07_SEG27_POSN                                  0x3
#define _LCDD07_SEG27_POSITION                              0x3
#define _LCDD07_SEG27_SIZE                                  0x1
#define _LCDD07_SEG27_LENGTH                                0x1
#define _LCDD07_SEG27_MASK                                  0x8
#define _LCDD07_SEG28_POSN                                  0x4
#define _LCDD07_SEG28_POSITION                              0x4
#define _LCDD07_SEG28_SIZE                                  0x1
#define _LCDD07_SEG28_LENGTH                                0x1
#define _LCDD07_SEG28_MASK                                  0x10
#define _LCDD07_SEG29_POSN                                  0x5
#define _LCDD07_SEG29_POSITION                              0x5
#define _LCDD07_SEG29_SIZE                                  0x1
#define _LCDD07_SEG29_LENGTH                                0x1
#define _LCDD07_SEG29_MASK                                  0x20
#define _LCDD07_SEG30_POSN                                  0x6
#define _LCDD07_SEG30_POSITION                              0x6
#define _LCDD07_SEG30_SIZE                                  0x1
#define _LCDD07_SEG30_LENGTH                                0x1
#define _LCDD07_SEG30_MASK                                  0x40
#define _LCDD07_SEG31_POSN                                  0x7
#define _LCDD07_SEG31_POSITION                              0x7
#define _LCDD07_SEG31_SIZE                                  0x1
#define _LCDD07_SEG31_LENGTH                                0x1
#define _LCDD07_SEG31_MASK                                  0x80

// Register: LCDD08
#define LCDD08 LCDD08
extern volatile unsigned char           LCDD08              __at(0x118);
#ifndef _LIB_BUILD
asm("LCDD08 equ 0118h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG00                  :1;
        unsigned SEG01                  :1;
        unsigned SEG02                  :1;
        unsigned SEG03                  :1;
        unsigned SEG04                  :1;
        unsigned SEG05                  :1;
        unsigned SEG06                  :1;
        unsigned SEG07                  :1;
    };
} LCDD08bits_t;
extern volatile LCDD08bits_t LCDD08bits __at(0x118);
// bitfield macros
#define _LCDD08_SEG00_POSN                                  0x0
#define _LCDD08_SEG00_POSITION                              0x0
#define _LCDD08_SEG00_SIZE                                  0x1
#define _LCDD08_SEG00_LENGTH                                0x1
#define _LCDD08_SEG00_MASK                                  0x1
#define _LCDD08_SEG01_POSN                                  0x1
#define _LCDD08_SEG01_POSITION                              0x1
#define _LCDD08_SEG01_SIZE                                  0x1
#define _LCDD08_SEG01_LENGTH                                0x1
#define _LCDD08_SEG01_MASK                                  0x2
#define _LCDD08_SEG02_POSN                                  0x2
#define _LCDD08_SEG02_POSITION                              0x2
#define _LCDD08_SEG02_SIZE                                  0x1
#define _LCDD08_SEG02_LENGTH                                0x1
#define _LCDD08_SEG02_MASK                                  0x4
#define _LCDD08_SEG03_POSN                                  0x3
#define _LCDD08_SEG03_POSITION                              0x3
#define _LCDD08_SEG03_SIZE                                  0x1
#define _LCDD08_SEG03_LENGTH                                0x1
#define _LCDD08_SEG03_MASK                                  0x8
#define _LCDD08_SEG04_POSN                                  0x4
#define _LCDD08_SEG04_POSITION                              0x4
#define _LCDD08_SEG04_SIZE                                  0x1
#define _LCDD08_SEG04_LENGTH                                0x1
#define _LCDD08_SEG04_MASK                                  0x10
#define _LCDD08_SEG05_POSN                                  0x5
#define _LCDD08_SEG05_POSITION                              0x5
#define _LCDD08_SEG05_SIZE                                  0x1
#define _LCDD08_SEG05_LENGTH                                0x1
#define _LCDD08_SEG05_MASK                                  0x20
#define _LCDD08_SEG06_POSN                                  0x6
#define _LCDD08_SEG06_POSITION                              0x6
#define _LCDD08_SEG06_SIZE                                  0x1
#define _LCDD08_SEG06_LENGTH                                0x1
#define _LCDD08_SEG06_MASK                                  0x40
#define _LCDD08_SEG07_POSN                                  0x7
#define _LCDD08_SEG07_POSITION                              0x7
#define _LCDD08_SEG07_SIZE                                  0x1
#define _LCDD08_SEG07_LENGTH                                0x1
#define _LCDD08_SEG07_MASK                                  0x80

// Register: LCDD09
#define LCDD09 LCDD09
extern volatile unsigned char           LCDD09              __at(0x119);
#ifndef _LIB_BUILD
asm("LCDD09 equ 0119h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG08                  :1;
        unsigned SEG09                  :1;
        unsigned SEG10                  :1;
        unsigned SEG11                  :1;
        unsigned SEG12                  :1;
        unsigned SEG13                  :1;
        unsigned SEG14                  :1;
        unsigned SEG15                  :1;
    };
} LCDD09bits_t;
extern volatile LCDD09bits_t LCDD09bits __at(0x119);
// bitfield macros
#define _LCDD09_SEG08_POSN                                  0x0
#define _LCDD09_SEG08_POSITION                              0x0
#define _LCDD09_SEG08_SIZE                                  0x1
#define _LCDD09_SEG08_LENGTH                                0x1
#define _LCDD09_SEG08_MASK                                  0x1
#define _LCDD09_SEG09_POSN                                  0x1
#define _LCDD09_SEG09_POSITION                              0x1
#define _LCDD09_SEG09_SIZE                                  0x1
#define _LCDD09_SEG09_LENGTH                                0x1
#define _LCDD09_SEG09_MASK                                  0x2
#define _LCDD09_SEG10_POSN                                  0x2
#define _LCDD09_SEG10_POSITION                              0x2
#define _LCDD09_SEG10_SIZE                                  0x1
#define _LCDD09_SEG10_LENGTH                                0x1
#define _LCDD09_SEG10_MASK                                  0x4
#define _LCDD09_SEG11_POSN                                  0x3
#define _LCDD09_SEG11_POSITION                              0x3
#define _LCDD09_SEG11_SIZE                                  0x1
#define _LCDD09_SEG11_LENGTH                                0x1
#define _LCDD09_SEG11_MASK                                  0x8
#define _LCDD09_SEG12_POSN                                  0x4
#define _LCDD09_SEG12_POSITION                              0x4
#define _LCDD09_SEG12_SIZE                                  0x1
#define _LCDD09_SEG12_LENGTH                                0x1
#define _LCDD09_SEG12_MASK                                  0x10
#define _LCDD09_SEG13_POSN                                  0x5
#define _LCDD09_SEG13_POSITION                              0x5
#define _LCDD09_SEG13_SIZE                                  0x1
#define _LCDD09_SEG13_LENGTH                                0x1
#define _LCDD09_SEG13_MASK                                  0x20
#define _LCDD09_SEG14_POSN                                  0x6
#define _LCDD09_SEG14_POSITION                              0x6
#define _LCDD09_SEG14_SIZE                                  0x1
#define _LCDD09_SEG14_LENGTH                                0x1
#define _LCDD09_SEG14_MASK                                  0x40
#define _LCDD09_SEG15_POSN                                  0x7
#define _LCDD09_SEG15_POSITION                              0x7
#define _LCDD09_SEG15_SIZE                                  0x1
#define _LCDD09_SEG15_LENGTH                                0x1
#define _LCDD09_SEG15_MASK                                  0x80

// Register: LCDD10
#define LCDD10 LCDD10
extern volatile unsigned char           LCDD10              __at(0x11A);
#ifndef _LIB_BUILD
asm("LCDD10 equ 011Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG16                  :1;
        unsigned SEG17                  :1;
        unsigned SEG18                  :1;
        unsigned SEG19                  :1;
        unsigned SEG20                  :1;
        unsigned SEG21                  :1;
        unsigned SEG22                  :1;
        unsigned SEG23                  :1;
    };
} LCDD10bits_t;
